/*******************************************************************************
* File         : key.c
* Version      : v1.0.0
* Author       : 钟昊翰
* CreateDate   : 2018/4/12
* Description  : 按键应用层
* Change Logs  : 
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include"main.h"
#include"drive.h"
#include"mid_key.h"
#include"key_app.h"

/* 私有类型 ------------------------------------------------------------------*/
/* 私有定义 ------------------------------------------------------------------*/
/* 私有宏   ------------------------------------------------------------------*/
/* 私有函数 ------------------------------------------------------------------*/
/* 私有常量 ----------------------------------------------------------------- */
/* 私有变量 ------------------------------------------------------------------*/
static uint16_t keyValue = 0;  // 该变量仅用于演示
/* 公有变量 ------------------------------------------------------------------*/

void f_Key0_P_0(void){keyValue += 1;}     // 按键0按下响应
void f_Key0_P_1(void){keyValue += 10;}    // 按键0按下响应 (根据“按键响应列表”可知,按键0长按3s,响应该函数)
void f_Key0_P_2(void){keyValue += 100;}   // 按键0按下响应 (根据“按键响应列表”可知,按键0长按5s,响应该函数)
void f_Key0_R_0(void){keyValue -= 1;}     // 按键0释放响应

void f_Key1_P_0(void){keyValue += 2;}
void f_Key1_P_1(void){keyValue += 20;}
void f_Key1_R_0(void){keyValue -= 2;}

void f_Key2_P_0(void){keyValue += 3;}
void f_Key2_P_1(void){keyValue += 30;}
void f_Key2_R_0(void){keyValue -= 3;}

void f_Key3_P_0(void){keyValue = 100;}
void f_Key3_P_1(void){keyValue = 200;}
void f_Key3_R_0(void){keyValue = 0;}