/******************************************************************************

                  版权所有 (C), 2008-2018, 杭州信多达电器有限公司

 ******************************************************************************
  文 件 名   : Main.c
  版 本 号   : V1.0
  作    者   : zhufeng
  生成日期   : 2018年4月27日
  最近修改   :
  功能描述   : 澳蒂遥控器主程序
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容   : 创建文件

******************************************************************************/
#define VAR_MAIN_GLOBALS
#include "Include.h"
/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/

/*****************************************************************************
 函 数 名: f_pReadEeprom
 功能描述  : 读取EEPROM的值
 输入参数: uchar nReadAdd  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
uchar f_pReadEeprom(uchar nReadAdd)
{
	uchar ReadData;
	_eea = nReadAdd; //设置EE地址
	_mp1 = 0x40; //设置EE指针
	__eec.bits.__rden = 1; //设置RDEN
	__eec.bits.__rd = 1; //开启读周期
	while (__eec.bits.__rd); //判断读结束
	NOP();
	NOP();
	NOP();
	_eec = 0; //清寄存器EEC
	ReadData = _eed; //读数据
	_mp1 = 0x00; //设置指针
	_eea = 0;
	_eed = 0;
	return ReadData;
}


/*****************************************************************************
 函 数 名: main
 功能描述  : 主函数
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
uchar temp;
void main(void)
{
	if(_to && _pdf)//看门狗休眠复位
	{
		GCC_NOP();
		GCC_NOP();
	}
	else
	{
		f_pSfrInit();
		//f_pPL1167Init();
		Cc2500Inf.RF_Channel[0] = 6;
		Cc2500Inf.RF_Channel[1] = 66;
		Cc2500Inf.RF_Channel[2] = 126;
		Cc2500Inf.RF_Channel[3] = 186;
		ADDR[0] = f_pReadEeprom(0);					//地址码1
		ADDR[1] = f_pReadEeprom(1);					//地址码2		
		ADDR[2] = f_pReadEeprom(2);					//地址码3
		f_Cc2500Init();
		LED = true;
	}
	while(1)
	{
		f_pFeedDog();//喂狗
		f_GetSendBuffRF();
		f_StartDataSend();
		//f_pSendDeal();
		//f_pRfRecDeal();
		f_pCalTm();
	}

}

/* =========================================================
* 函 数 名: void f_pCalTm()
* 功能描述: 计算运行时间,如果到60秒则分加1,并保存各时间最大值
* 调用方法: f_pCalTm();
* 调用函数: 无
* 全局变量: 
========================================================= */
void f_pCalTm(void)
{
	if(b10msFlag)	//10ms到
	{
		b10msFlag = false;
		f_pKeyScan();//按键扫描
		f_pKeyDeal();//按键处理
	}
	if(b100msFlag)
	{
		b100msFlag = false;
		f_pGoToHalt();
	}
}

/*****************************************************************************
 函 数 名: f_pGoToHalt
 功能描述  : 进入休眠模式
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pGoToHalt(void)
{	
	if(nKeyWakeTm < 250)//按键唤醒时间
		nKeyWakeTm ++;
	if (!bInSleepFlag)
	{
		if(nKeyWakeTm >= 30)		/* 按键触发后3s后进入sleep模式 */
		{
			bInSleepFlag = true;
		}
		return;
	}
	_lvden=0;
	_wdtc=0xaf;
	KEY_COM1 = false;
	KEY_COM2 = false;
	KEY_COM3 = false;
	KEY_COM4 = false;
	f_SleepCC2500();
	GCC_HALT();
	GCC_NOP();
	GCC_NOP();
	GCC_NOP();
	GCC_NOP();
	GCC_NOP();
	//f_InitCC2500(Cc2500Inf.RF_Channel[Cc2500Inf.RF_Channel_Index]);//初始化2.4G
}