/*******************************************************************************
* File         : key_cfg.h
* Version      : v1.0.0
* Author       : 钟昊翰
* CreateDate   : 2018/4/13
* Description  : 按键配置层
* Change Logs  : 
*******************************************************************************/
#ifndef __KEY_CFG_20180413_H__
#define __KEY_CFG_20180413_H__

/* Includes ------------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
typedef enum
{
    KEY_CODE0 = 0,
    KEY_CODE1,
    KEY_CODE2,
    KEY_CODE3,
    KEY_CODE_NUM   // 键码数量,调用者禁止修改该枚举元素
}KeyCode_t;

/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void f_KeyCfg(void);
/* Exported variables ------------------------------------------------------- */



#endif
