/******************************************************************************

                  版权所有 (C), 2008-2018, 杭州信多达电器有限公司

 ******************************************************************************
  文 件 名   : ICTM1640.h
  版 本 号   : V1.0
  作    者   : 钱百静
  生成日期   : 2018年8月30日
  最近修改   :
  功能描述   : TM1640驱动
  函数列表   :
  修改历史   :
  1.日    期   : 2018年8月30日
    作    者   : 钱百静
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/
#include "ICTM1640.h"

/*----------------------------------------------*
 * 外部变量说明                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                         *
 *----------------------------------------------*/
IC_DRIVER_TM1640 tm1640;

/*----------------------------------------------*
 * 模块级变量                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/

/*****************************************************************************
 函 数 名: f_TM1640_Init
 功能描述  : 初始化
 输入参数  :
 输出参数  :
 返 回 值: 
 注     意: 
 
 修改历史      :
  1.日    期   : 2018年8月30日
    作    者   : 钱百静
    修改内容   : 新生成函数

*****************************************************************************/
void f_TM1640_Init(I2C_DRIVER *pDriver)
{
    f_Memset(&tm1640, 0, sizeof(IC_DRIVER_TM1640));
    tm1640->pI2CDriver = pDriver;
}

/*****************************************************************************
 函 数 名: f_TM1640Display
 功能描述  : 启动显示控制(自动模式)
 输入参数  : startAddr 起始地址
           data数据地址
           len数据长度
           degree显示等级(包括开关)
 输出参数  :
 返 回 值: 
 注     意: 
 
 修改历史      :
  1.日    期   : 2018年8月30日
    作    者   : 钱百静
    修改内容   : 新生成函数

*****************************************************************************/
void f_TM1640DisplayAuto(uchar startAddr, uchar *data, uchar len, uchar degree)
{
    uchar i;
    
    //cmd1
    f_I2CDriverStart(tm1640.pI2CDriver);
    f_I2CDriverWriteByte(tm1640.pI2CDriver, TM1640_DATA_AUTO_ADD);
    f_I2CDriverStop(tm1640.pI2CDriver);

    //cmd2
    f_I2CDriverStart(tm1640.pI2CDriver);
    f_I2CDriverWriteByte(tm1640.pI2CDriver, startAddr);
    //data
    for (i = 0; i < len; i++)
    {
        f_I2CDriverWriteByte(tm1640.pI2CDriver, data[i]);    
    }
    f_I2CDriverStop(tm1640.pI2CDriver);

    //cmd3
    f_I2CDriverStart(tm1640.pI2CDriver);
    f_I2CDriverWriteByte(tm1640.pI2CDriver, TM1640_LED_LEVEL_14);
    f_I2CDriverStop(tm1640.pI2CDriver);
}

 

