#ifndef __GLOBAL_VALUE_H__
#define __GLOBAL_VALUE_H__

#ifdef VAR_FUNCTION_GLOBALS
	#define VAR_FUNCTION_EXT 
#else
	#define VAR_FUNCTION_EXT extern
#endif

/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/
#include "DataType.h"
#include "TempSensor.h"
#include "CommDriver.h"


/*----------------------------------------------*
 * 数据类型定义                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量声明                                      *
 *----------------------------------------------*/




/*----------------------------------------------*
 * 模块级函数声明                                      *
 *----------------------------------------------*/


#endif /* __GLOBAL_VALUE_H__ */
