#ifndef __MAIN_H__
#define __MAIN_H__

/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/
#include "DataType.h"

/*----------------------------------------------*
 * 数据类型定义                                        *
 *----------------------------------------------*/
typedef enum 
{
	SYS_STATE_STANDBY, //待机状态
	SYS_STATE_RUN, //运行状态
	SYS_STATE_AGING,//老化模式
	SYS_STATE_SELFCHECK//自检模式
}SYSTEM_STATE;//系统状态

typedef struct 
{
	SYSTEM_STATE sysState;
	uchar powerOnTm;
}SYSTEM_INFO;

/*----------------------------------------------*
 * 模块级变量声明                                      *
 *----------------------------------------------*/
extern SYSTEM_INFO systemInfo;

/*----------------------------------------------*
 * 模块级函数声明                                      *
 *----------------------------------------------*/


#endif /* __MAIN_H__ */

