/******************************************************************************

                  版权所有 (C), 2008-2018, 杭州信多达电器有限公司

 ******************************************************************************
  文 件 名   : Main.c
  版 本 号   : V1.0
  作    者   : zhufeng
  生成日期   : 2018年4月27日
  最近修改   :
  功能描述   : 澳蒂遥控器主程序
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容   : 创建文件

******************************************************************************/
#define VAR_MAIN_GLOBALS
#include "Include.h"
/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/

/*****************************************************************************
 函 数 名: f_pReadEeprom
 功能描述  : 读取EEPROM的值
 输入参数: uchar nReadAdd  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
uchar f_pReadEeprom(uchar nReadAdd)
{
	uchar ReadData;
	_eea = nReadAdd; //设置EE地址
	_mp1 = 0x40; //设置EE指针
	__eec.bits.__rden = 1; //设置RDEN
	__eec.bits.__rd = 1; //开启读周期
	while (__eec.bits.__rd); //判断读结束
	NOP();
	NOP();
	NOP();
	_eec = 0; //清寄存器EEC
	ReadData = _eed; //读数据
	_mp1 = 0x00; //设置指针
	_eea = 0;
	_eed = 0;
	return ReadData;
}


/*****************************************************************************
 函 数 名: main
 功能描述  : 主函数
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void main(void)
{
	if(_to && _pdf)//看门狗休眠复位
	{
		GCC_NOP();
		GCC_NOP();
	}
	else
	{
		f_pSfrInit();
		//f_pPL1167Init();
		f_InitCC2500(Cc2500Inf.RF_Channel[Cc2500Inf.RF_Channel_Index]);//初始化2.4G
		ADDR[0] = f_pReadEeprom(0);					//地址码1
		ADDR[1] = f_pReadEeprom(1);					//地址码2		
		ADDR[2] = f_pReadEeprom(2);					//地址码3
	}
	while(1)
	{
		f_pFeedDog();//喂狗
		f_GetSendBuffRF();
		//f_pSendDeal();
		//f_pRfRecDeal();
		f_pCalTm();
	}

}

/* =========================================================
* 函 数 名: void f_pCalTm()
* 功能描述: 计算运行时间,如果到60秒则分加1,并保存各时间最大值
* 调用方法: f_pCalTm();
* 调用函数: 无
* 全局变量: 
========================================================= */
void f_pCalTm(void)
{
	//static unsigned char temp=0;
	if(b5msFlag)
	{
		b5msFlag = false;
	}
	if(b10msFlag)	//10ms到
	{
		b10msFlag = false;
		f_pKeyScan();//按键扫描
		f_pKeyDeal();//按键处理
		n50msCnt ++;
		if(n50msCnt > 4)								//50ms meeted
		{
			n50msCnt = 0;
			b50msFlag = true;
			n1sCnt ++;
			if((n1sCnt % 2) == 0)						//100ms meeted
			{
				b100msFlag = true;
				//f_pGoToHalt();
			}
			if((n1sCnt % 5) == 0)						//250ms meeted 
			{
				b250msFlag = true;
			}		
			if((n1sCnt % 10) == 0)						//500ms meeted 
			{
				b500msFlag = true;
				b1HzFlag ^= true;
			}
				
			if(n1sCnt >= 20)							//1s meeted
			{
				n1sCnt = 0;
				b1sFlag = true;
				b0d5HzFlag ^= true;
			}
		}
	}
	if(b100msFlag)	//100ms meeted
	{
		b100msFlag = false;
	}
	if(b250msFlag)
	{
		b250msFlag = false;
	}
	if(b500msFlag)
	{
		b500msFlag = false;
	}
	if(b1sFlag)	//1S meeted
	{
		b1sFlag = false;
//		f_pFreqDeal();
//		if(temp == 0)
//		{
//			temp = 1;
//			LED = 0;
//		}
//		else
//		{
//			temp = 0;
//			LED = 1;
//		}
	}
}

/*****************************************************************************
 函 数 名: f_pGoToHalt
 功能描述  : 进入休眠模式
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月27日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pGoToHalt(void)
{	
	if(nKeyWakeTm < 250)//按键唤醒时间
		nKeyWakeTm ++;
	if (!bInSleepFlag)
	{
		if(nKeyWakeTm >= 30)		/* 按键触发后3s后进入sleep模式 */
		{
			bInSleepFlag = true;
		}
		return;
	}
	//_t0on = 0;		//定时器0关闭																					//关闭定时器
	_adoff = 1;		//ad关闭
	KEY_COM1 = false;
	KEY_COM2 = false;
	KEY_COM3 = false;
	KEY_COM4 = false;
	_idlen = 0;			//休眠模式1->看门狗计数自动清0,时基定时器会关闭
														
	GCC_HALT();
	GCC_NOP();
	GCC_NOP();
	GCC_NOP();
	GCC_NOP();
	GCC_NOP();
}