/******************************************************************************

                  版权所有 (C), 2008-2018, 杭州信多达电器有限公司

 ******************************************************************************
  文 件 名   : TempSensorHardware.c
  版 本 号   : V1.0
  作    者   : 钱百静
  生成日期   : 2018年5月7日
  最近修改   :
  功能描述   : 温度传感器硬件驱动部分，用于获取AD、通-
                   道、阻值表等
  函数列表   :
  修改历史   :
  1.日    期   : 2018年5月7日
    作    者   : 钱百静
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/
#include "TempSensorHardware.h"
#include "IO_Define.h"

/*----------------------------------------------*
 * 外部变量说明                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                     *
 *----------------------------------------------*/
sint f_CalcNTC_3435(slong volt, TEMP_DEGREE degree);


/*----------------------------------------------*
 * 全局变量                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                        *
 *----------------------------------------------*/
 

/*----------------------------------------------*
 * 常量定义                                         *
 *----------------------------------------------*/
//风温硬件驱动
const TEMP_SENSOR_HARDWARE seatTempHarware = 
{
	SEAT_TEMP_AD_CHANNEL, //通道
	true, //是否上拉
	4000, //开路值(12Bit)
	50, //短路值(12Bit)
	f_MCU_GetAD, //AD采样函数
	f_CalcNTC_3435,
	DEGREE_TEMP_0d1 //精度0.1度
};


/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/

/*****************************************************************************
 函 数 名: f_CalcNTC_3435
 功能描述  : NTC3435电压温度曲线
 输入参数  : slong volt          
             TEMP_DEGREE degree  
 输出参数  :
 返 回 值: 
 注     意: 电压放大了1000倍传入
 
 修改历史      :
  1.日    期   : 2018年9月6日
    作    者   : 钱百静
    修改内容   : 新生成函数

*****************************************************************************/
sint f_CalcNTC_3435(slong volt, TEMP_DEGREE degree)
{
//    #define COEFF_A -2045L //系数A
//    #define COEFF_B 17203L //系数B
//    #define COEFF_C -68176L //系数C
//    #define COEFF_D 119650L //系数D

//    //y = A*X^3 + B*X^2 + C*X + D 
//    slong temp = 0;
//    temp = COEFF_A*volt/1000;
//    temp = (temp + COEFF_B)*volt/1000;
//    temp = (temp + COEFF_C)*volt/1000;
//    temp = temp + COEFF_D;

    #define COEFF_A 468L //系数A
    #define COEFF_B -6460L //系数B
    #define COEFF_C 31615L //系数C
    #define COEFF_D -87105L //系数D
    #define COEFF_E 127930L //系数D

    //y = A*X^4 + B*X^3 + C*X^2 + D*X + E 
    slong temp = 0;
    temp = COEFF_A*volt/1000;
    temp = (temp + COEFF_B)*volt/1000;
    temp = (temp + COEFF_C)*volt/1000;
    temp = (temp + COEFF_D)*volt/1000;
    temp = temp + COEFF_E;

    return (sint)((temp + (slong)(degree/2))/(slong)(degree)); //输出数据四舍五入
}



