/******************************************************************************

                  版权所有 (C), 2008-2018, 杭州信多达电器有限公司

 ******************************************************************************
  文 件 名   : Cpu_init.c
  版 本 号   : V1.0
  作    者   : zhufeng
  生成日期   : 2018年4月28日
  最近修改   :
  功能描述   : 207芯片初始化文件
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容   : 创建文件

******************************************************************************/
#define VAR_INIT003_GLOBALS
#include "Include.h"
/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                         *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/

/*****************************************************************************
 函 数 名: f_pCpuClkInit
 功能描述  : CPU时钟初始化
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pCpuClkInit(void)
{
	CLK_ECKR &= 0xfe;			//使用内部晶振(PA1.2可用于GPIO)
	CLK_CKDIVR = 0x00;          		// 01: fHSI= fHSI RC output/1 = 16M. 
	while(!(CLK_ICKR&0x02));		//等待就绪
}

/*****************************************************************************
 函 数 名: f_pCpuIoInit
 功能描述  : CPU的IO口初始化
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pCpuIoInit(void)
{
    /**************IO口配置**************/
    //			DDR				CR1			CR2			ADC_TDR
    //输出：	1				1				0				X				推挽输出		
    //输入：	0				0				0				X				悬浮输入		
    //AD输入：  0				0				0				1				禁止施密特触发		
    //当使用模拟通道的时候，ADT_TDR寄存器的输入施密特触发器必须被关闭

    PA_DDR = 0b00001110; 
    PA_CR1 = 0b11111111;          		
    PA_CR2 = 0b00000000; 					  		
  
    PB_DDR = 0b00000000; 
    PB_CR1 = 0b11001111;          		
    PB_CR2 = 0b00000000;      
    //EXTI_CR1 |= 0x08;//PB口下降沿中断 
    PC_DDR = 0b11111000;          		
    PC_CR1 = 0b11111111;          		
    PC_CR2 = 0b00000000;          		

    PD_DDR = 0b00111100;   
    PD_CR1 = 0b10111111; 
    PD_CR2 = 0b00000000;  
	
//    PA_DDR = 0x0E; 
//    PA_CR1 = 0xFF;          		
//    PA_CR2 = 0x00; 					  		
//  
//    PB_DDR = 0x20; 
//    PB_CR1 = 0xFF;          		
//    PB_CR2 = 0x00;      
//    //EXTI_CR1 |= 0x08;//PB口下降沿中断 
//    PC_DDR = 0xF8;          		
//    PC_CR1 = 0xFF;          		
//    PC_CR2 = 0x00;          		

//    CFG_GCR |= 0x01; 
//    PD_DDR = 0x3C;   
//    PD_CR1 = 0xFF; 
//    PD_CR2 = 0x00;  
    
//    PE_DDR = 0b11101001;          					
//    PE_CR1 = 0b11111111;          		
//    PE_CR2 = 0b00000000; 

//	PF_DDR = 0b11001000;          		
//	PF_CR1 = 0b11001110;          		
//	PF_CR2 = 0b00000000;  
  
//    PG_DDR = 0b00000011;          		
//    PG_CR1 = 0b11111111;          		
//    PG_CR2 = 0b00000000;

//  PI_DDR = 0b00000000;          		
//	PI_CR1 = 0b11111110;          		
//	PI_CR2 = 0b00000000;
}

/*****************************************************************************
 函 数 名: f_pCpuAdPortInit
 功能描述  : AD采集初始化
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pCpuAdPortInit(void)
{
	ADC_CR1 = 0x62;		//fadc=fmaster/12,连续模式,启动AD
	ADC_CR2 = 0x00;		//数据左对齐，禁止扫描模式,
	//
	ADC_TDRL = 0x00;	//作I/O时使能端口的施密特触发器功能，作ad口时必须禁止施密特触发器可以降低I/O口静态功耗
	ADC_TDRH = 0x00;
}

/*****************************************************************************
 函 数 名: f_pCpuDongInit
 功能描述  : CPU看门狗初始化
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pCpuDongInit(void)
{
	IWDG_KR = 0xcc;					//启动看门狗
	IWDG_KR = 0x55;					//看门狗寄存器去保护
	IWDG_RLR = 0xff;					//看门狗重新装载数值
	IWDG_PR = 0x06;					//64K的128分频,最长1.02S
	IWDG_KR = 0xaa;					//看门狗寄存器保护,同时启动看门狗
}

/*****************************************************************************
 函 数 名: f_pCpuFeedDog
 功能描述  : CPU看门狗喂狗
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pCpuFeedDog(void)
{
	IWDG_KR=0xaa;					//喂狗
}

/*****************************************************************************
 函 数 名: f_pTimeInit
 功能描述  : CPU定时器初始化
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pTimeInit(void)
{
	/*定时时基100us*/	
	TIM1_PSCRH = 0;
	TIM1_PSCRL = 0x0f;	//f= fmain/(PSCR+1)=16/(15 + 1)=1M=1us
	TIM1_ARRH = 0x03;	//产生一个1mss的时基 ARR = 999
	TIM1_ARRL = 0xe7;
	TIM1_IER |= 0x01;
	TIM1_CR1  |= 0x01;	//使能定时器1

//	/* Tim2 蜂鸣器PWM*/
//	TIM2_CR1 = 0x00;
//	TIM2_PSCR = 0x04; //f= fmain/2^(PSCR)=16/(16)=1M=1us
//	TIM2_IER = 0x00; //禁止中断
//	TIM2_CCMR1 = 0x48; //CH1 强制输出低，开启预装功能，CC1通道配置为输出
//	TIM2_CCER1 = 0x01; //高电平有效,开启输出
//	//TIM2_CR1 |= 0x11;			//使能定时器2
//	TIM2_CR1 |= 0x81; //使能定时器2
	
	/*Time4 定时时基100us*/
//	TIM4_IER = 0;
//	TIM4_PSCR = 0x04;				// 100us = f(CK_PSC)/(2^(PSCR))(0~7)=16M/2^4 = 1M
//	TIM4_ARR = 0x63;				//产生一个100us的时基 ARR = 99
//	TIM4_CNTR = 0;
//	TIM4_IER |= 0x01;
//	TIM4_CR1 |= 0x01;				//使能定时器4
}

/*****************************************************************************
 函 数 名: f_pCpuInit
 功能描述  : CPU初始化
 输入参数: void  
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年4月28日
    作    者   : zhufeng
    修改内容    : 新生成函数

*****************************************************************************/
void f_pCpuInit(void)
{
	f_pCpuClkInit();
	f_pCpuIoInit();
	f_pTimeInit();
    f_pCpuAdPortInit();
	f_pCpuDongInit();
}
