

/******************************************************************************

				  版权所有 (C), 2008-2018, 杭州信多达电器有限公司

 ******************************************************************************
  文 件 名	: StepMotorHardware.c
  版 本 号	: V1.0
  作	 者   : 钱百静
  生成日期	 : 2018年4月18日
  最近修改	 :
  功能描述	 : 步进电机硬件驱动
  函数列表	 :
  修改历史	 :
  1.日    期	 : 2018年4月18日
	作    者	 : 钱百静
	修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件										*
 *----------------------------------------------*/
#include "StepMotorHardware.h"
#include "IO_Define.h"

/*----------------------------------------------*
 * 外部变量说明										*
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明 									*
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明 									*
 *----------------------------------------------*/
void f_StepmotorNozzleOut(STEPMOTER_DRIVER * pDriver, uchar phase);
void f_StepmotorFlowOut(STEPMOTER_DRIVER * pDriver, uchar phase);

/*----------------------------------------------*
 * 全局变量 										*
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量										  *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义 										*
 *----------------------------------------------*/
#define PHASE_NUM_4_8			8//四相八拍
const uchar Tab_Step_8[] =
{
	0x01, 0x03, 0x02, 0x06, 0x04, 0x0c, 0x08, 0x09
};


#define PHASE_NUM_4_4			4//四相四拍
const uchar Tab_Step_4[] =
{
	0x03, 0x06, 0x0c, 0x09
};

//喷杆步进电机硬件驱动
const STEPMOTOR_HARDWARE_DRIVER StepmotorHdSprayNozzle =
{
	f_StepmotorNozzleOut,
	Tab_Step_8,
	PHASE_NUM_4_8,
	10,//步间隔1ms 1KHz
	33, //启动步间隔3.3ms 300HZ
	tab_ResetStep_Nozzle
};

//流量步进电机硬件驱动
const STEPMOTOR_HARDWARE_DRIVER StepmotorHdSprayFlow =
{
	f_StepmotorFlowOut,
	Tab_Step_8,
	PHASE_NUM_4_8,
	10,//步间隔1ms 1KHz
	33, //启动步间隔3.3ms 300HZ
	tab_ResetStep_Flow
};

//喷杆复位位置
const sint tab_ResetStep_Nozzle[] =
{
	SM_NOZZLE_MAX_POS,//最大位置
	SM_NOZZLE_MIN_POS,//最小位置
	SM_ORG_POS
};

//流量复位位置
const sint tab_ResetStep_Flow[] =
{
	SM_FLOW_MAX_POS,//最大位置
	SM_FLOW_MIN_POS,//最小位置
	SM_ORG_POS
};

/*----------------------------------------------*
 * 宏定义										    *
 *----------------------------------------------*/


 

/*****************************************************************************
 函 数 名: f_StepmotorNozzleOut
 功能描述  : 喷杆步进电机硬件输出
 输入参数: pDriver:驱动指针
 		   phase:当前相
 返 回 值: 
 注	 意: 
 
 修改历史:
  1.日    期	 : 2018年4月18日
	作    者	 : 钱百静
	修改内容	: 新生成函数

*****************************************************************************/
void f_StepmotorNozzleOut(STEPMOTER_DRIVER * pDriver, uchar phase)
{
	NOZZLE_SM_A(phase&0x01);
    NOZZLE_SM_B((phase>>1)&0x01);
    NOZZLE_SM_C((phase>>2)&0x01);
    NOZZLE_SM_D((phase>>3)&0x01);
}

/*****************************************************************************
 函 数 名: f_StepmotorFlowOut
 功能描述  : 流量步进电机硬件输出
 输入参数: pDriver:驱动指针
 		   phase:当前相
 返 回 值: 
 注     意: 
 
 修改历史:
  1.日    期   : 2018年5月7日
    作    者   : 钱百静
    修改内容    : 新生成函数

*****************************************************************************/
void f_StepmotorFlowOut(STEPMOTER_DRIVER * pDriver, uchar phase)
{
    FLOW_SM_A(phase&0x01);
    FLOW_SM_B((phase>>1)&0x01);
    FLOW_SM_C((phase>>2)&0x01);
    FLOW_SM_D((phase>>3)&0x01);
}

