#ifndef __FLASH_TO_EEPROM_H__
#define __FLASH_TO_EEPROM_H__

/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/
#include "DataType.h"
#include "MCU_Hardware.h"
#include "StorageDriver.h"



/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量声明                                      *
 *----------------------------------------------*/
extern const STORAGE_HARDWARE storageHardware;


/*----------------------------------------------*
 * 模块级函数声明                                      *
 *----------------------------------------------*/
void f_FlashToEEPROMInit(void);


#endif /* __FLASHTOEEPROM_H__ */
