#ifndef __IR_CONFIG_H__
#define __IR_CONFIG_H__

/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/
#define IR_HEAD_LOW_TM 50//引导码低电平,单位100us
#define IR_HEAD_PERIOD_TM 60//引导码周期,单位100us

#define IR_END_LOW_TM 10//结束码低电平,单位100us
#define IR_END_PERIOD_TM 10//结束码周期,单位100us

#define IR_DATA_0_LOW_TM 5//数据0低电平,单位100us
#define IR_DATA_0_PERIOD_TM 10//数据0周期,单位100us

#define IR_DATA_1_LOW_TM 5//数据1低电平,单位100us
#define IR_DATA_1_PERIOD_TM 20//数据1周期,单位100us

#define IR_READ_LOW_RANGE 2//读取低电平允许误差,单位100us
#define IR_READ_PERIOD_RANGE 4//读取周期误差,单位100us

#define IR_MAX_PERIOD_TM 80//读取最大周期时间,单位100us

/*----------------------------------------------*
 * 模块级变量声明                                      *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级函数声明                                      *
 *----------------------------------------------*/


#endif /* __IR_CONFIG_H__ */
